let imgTheme
const SUN_ICON = 'M8 12a4 4 0 1 0 0-8 4 4 0 0 0 0 8zM8 0a.5.5 0 0 1 .5.5v2a.5.5 0 0 1-1 0v-2A.5.5 0 0 1 8 0zm0 13a.5.5 0 0 1 .5.5v2a.5.5 0 0 1-1 0v-2A.5.5 0 0 1 8 13zm8-5a.5.5 0 0 1-.5.5h-2a.5.5 0 0 1 0-1h2a.5.5 0 0 1 .5.5zM3 8a.5.5 0 0 1-.5.5h-2a.5.5 0 0 1 0-1h2A.5.5 0 0 1 3 8zm10.657-5.657a.5.5 0 0 1 0 .707l-1.414 1.415a.5.5 0 1 1-.707-.708l1.414-1.414a.5.5 0 0 1 .707 0zm-9.193 9.193a.5.5 0 0 1 0 .707L3.05 13.657a.5.5 0 0 1-.707-.707l1.414-1.414a.5.5 0 0 1 .707 0zm9.193 2.121a.5.5 0 0 1-.707 0l-1.414-1.414a.5.5 0 0 1 .707-.707l1.414 1.414a.5.5 0 0 1 0 .707zM4.464 4.465a.5.5 0 0 1-.707 0L2.343 3.05a.5.5 0 1 1 .707-.707l1.414 1.414a.5.5 0 0 1 0 .708z'
const MOON_ICON = 'M6 .278a.768.768 0 0 1 .08.858 7.208 7.208 0 0 0-.878 3.46c0 4.021 3.278 7.277 7.318 7.277.527 0 1.04-.055 1.533-.16a.787.787 0 0 1 .81.316.733.733 0 0 1-.031.893A8.349 8.349 0 0 1 8.344 16C3.734 16 0 12.286 0 7.71 0 4.266 2.114 1.312 5.124.06A.752.752 0 0 1 6 .278z'
const CSRFTOKEN = document.querySelector('[name=csrfmiddlewaretoken]').value;
const PIN_ICON = 'M9.828.722a.5.5 0 0 1 .354.146l4.95 4.95a.5.5 0 0 1 0 .707c-.48.48-1.072.588-1.503.588-.177 0-.335-.018-.46-.039l-3.134 3.134a5.927 5.927 0 0 1 .16 1.013c.046.702-.032 1.687-.72 2.375a.5.5 0 0 1-.707 0l-2.829-2.828-3.182 3.182c-.195.195-1.219.902-1.414.707-.195-.195.512-1.22.707-1.414l3.182-3.182-2.828-2.829a.5.5 0 0 1 0-.707c.688-.688 1.673-.767 2.375-.72a5.922 5.922 0 0 1 1.013.16l3.134-3.133a2.772 2.772 0 0 1-.04-.461c0-.43.108-1.022.589-1.503a.5.5 0 0 1 .353-.146zm.122 2.112v-.002.002zm0-.002v.002a.5.5 0 0 1-.122.51L6.293 6.878a.5.5 0 0 1-.511.12H5.78l-.014-.004a4.507 4.507 0 0 0-.288-.076 4.922 4.922 0 0 0-.765-.116c-.422-.028-.836.008-1.175.15l5.51 5.509c.141-.34.177-.753.149-1.175a4.924 4.924 0 0 0-.192-1.054l-.004-.013v-.001a.5.5 0 0 1 .12-.512l3.536-3.535a.5.5 0 0 1 .532-.115l.096.022c.087.017.208.034.344.034.114 0 .23-.011.343-.04L9.927 2.028c-.029.113-.04.23-.04.343a1.779 1.779 0 0 0 .062.46z'
const PINNED_ICON = 'M9.828.722a.5.5 0 0 1 .354.146l4.95 4.95a.5.5 0 0 1 0 .707c-.48.48-1.072.588-1.503.588-.177 0-.335-.018-.46-.039l-3.134 3.134a5.927 5.927 0 0 1 .16 1.013c.046.702-.032 1.687-.72 2.375a.5.5 0 0 1-.707 0l-2.829-2.828-3.182 3.182c-.195.195-1.219.902-1.414.707-.195-.195.512-1.22.707-1.414l3.182-3.182-2.828-2.829a.5.5 0 0 1 0-.707c.688-.688 1.673-.767 2.375-.72a5.922 5.922 0 0 1 1.013.16l3.134-3.133a2.772 2.772 0 0 1-.04-.461c0-.43.108-1.022.589-1.503a.5.5 0 0 1 .353-.146z'

// Смена темы
$(document).ready(function() {
    $(".switcher").click(function() {
        $.ajax({
            method: 'post',
            headers: {'X-CSRFToken': CSRFTOKEN},
            data: 'switch-theme-ajax', // Данные, которые отправляются на сервер
            success: function(data) {
                if (data.theme === 'light') {
                    data.theme = 'dark'
                    imgTheme = SUN_ICON
                } else {
                    data.theme = 'light'
                    imgTheme = MOON_ICON
                }

                // Замена атрибутов в HTML
                $('#html').attr('data-bs-theme', data.theme);
                $('.img').attr('src', `/static/main/img/logo-${data.theme}.png`);
                $('.img-theme').attr('d', imgTheme);

            }
        });
        return false;
    });
});

// Закрепление поста
$(document).ready(function() {
    $(".pinner").click(function() {
        let id = $(this).attr('id') // Получение id поста, на который нажали
        let iconButton = $(`.pin-icon-${id}`) // Иконка кнопки, на которую нажали

        $.ajax({
            method: 'post',
            headers: {'X-CSRFToken': CSRFTOKEN},
            data: {'pin-post-ajax': true, 'id': id}, // Данные, которые отправляются на сервер
            success: function(data) {

                // Проверка на иконку закрепленного поста
                if (iconButton.attr('d') === PIN_ICON) {

                    let postsCount = $('.card-body').length // Общее количество постов
                    let num = 0 // Счетчик

                    // У каждого поста пропадает закреп
                    while (postsCount > num) {
                        $(`.pin-icon`).attr('d', PIN_ICON)
                        num = num + 1
                    }

                    // У выбранного поста появляется иконка закрепа
                    iconButton.attr('d', PINNED_ICON);

                    // В HTML в блок div.posts в начало добавляется закрепленный пост
                    $('.posts').prepend($(`.post-${id}`))
                } else {
                    // Если пост был закреплен, то иконка закрепа пропадает
                    iconButton.attr('d', PIN_ICON);
                }

            }
        });
        return false;
    });
});

// Проверка на одинаковое название при добавлении поста
$(document).ready(function() {
    $(".add-post").click(function() {
        title = document.querySelector('[placeholder="Название записи"]').value // Названия поста из input
        text = document.querySelector('[placeholder="Текст"]').value // Текст из input
        $.ajax({
            method: 'post',
            headers: {'X-CSRFToken': CSRFTOKEN},
            data: {'add-post-ajax': true, 'title': title, 'text': text}, // Данные, которые отправляются на сервер
            success: function(data) {

                if (data.newPost === true) { // Редирект на главную страницу в случае если название поста уникальное
                    window.location.href = '/'
                } else {
                    alert('Пост с таким названием уже существует. Название должно быть уникальным.')
                }
            }
        });
        return false;
    });
});